:PROPERTIES:
:FILETAGS: programming python freecodecamp
:ID: budgetcalc
:END:
#+Title: Python Budget Calculator Instructions

*** Spend chart
- Outside the class, create_spend_chart function that takes a list of categories and returns a string that is a bar chart.
- Chart shows percentage spent in each category passed.
- Percentage spent is calculated only with withdrawals.
- Left side labeled 0-100.
- Bars are "o" character.
- Bars rounded down to nearest 10.
- Horizontal divider goes two spaces past final bar.
- Each category name written vertically below divider.
- Title at top says "Percentage spent by category."
- Up to four categories.



#+BEGIN_SRC python :results output
class Category:





def create_spend_chart(categories):
#+END_SRC

#+RESULTS:
: test!



#+BEGIN_SRC shell :results output
date
#+END_SRC

#+RESULTS:
: Fri Apr 21 21:07:31 CEST 2023
